IdeaRS.Connections
ManufacturingOperationData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ManufacturingOperationData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ManufacturingOperationData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ManufacturingOperationData
The ManufacturingOperationData type exposes the following members.
Constructors
Name | Description
ManufacturingOperationData
Initializes a new instance of the ManufacturingOperationData class
Top
Properties
Name | Description
CommandId
ParameterId
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace